package somethinggreen;

/**
 * Это Интерфейс. Не тот интерфейс, на уровне которого надо программировать.
 *
 * @author надеется остаться неизвестным.
 * @version крайняя
 * @since в последний момент.
 */
public interface Contract {

    /**
     * Дефолтный метод интерфейса. Что вы там говорили про множественное наследование?
     * Нет в Java? А что насчёт дефолтных методов?
     */
    default void soTellMeAboutInterfaces() {
        System.out.println("Все методы интерфейсов асбтрактные. Кроме этого. Наверное, всё дело в ключевом слове");
    }

    /**
     * Счётчик тех, кто не понимает в ООП.
     * @return хорошо бы всегда возвращал 0
     */
    int count();

}
